gcadet2016/ESP32-CAM_Bras_robot/ESP32-CAM_Bras_robot.ino
/*
  Minimum code for Autoconnect:
    https://hieromon.github.io/AutoConnect/gettingstarted.html

  Sources: 
    Camera streaming: https://github.com/Hieromon/AutoConnect/blob/master/examples/WebCamServer/WebCamServer.ino
    Caution: esp32ap wifi access point password: 12345678
    https://esp32io.com/tutorials/esp32-websocket

  Libraries:
    Autoconnect (available in Arduino library manager): https://github.com/Hieromon/AutoConnect
    WebSockets by Markus Sattler: https://github.com/Links2004/arduinoWebSockets
    Preference NVS memory access https://github.com/vshymanskyy/Preferences
    ArduinoJson 6.21.5

  D1 BoardNodeMCU ESP8266 (AzDelivery)
    Board: esp8266 --> Arduino
    Caution: 2019 & 2023 Driver must be uninstalled from Windows
    Compilation fails when ESP8266 selected
  ESP-EYE
    Board: ESP32 Dev Module
    Code test: Ok
  ESP32-CAM
    Board: AI Thinker ESP32-CAM
    Code test: Ok
  ESP32_DEVKIT
    Board: ESP32 dev kit 
    Code test: not tested


  url à tester: voir readme.md

*/

//#define ESP_EYE
#define ESP32_CAM
//#define ESP8266
//#define ESP32_DEVKIT

// DEBUG
#define DEBUG
#define BAUD_RATE 9600      // LU9685 baud rate

/**
 * Specify one of the following supported sensor modules to be actually applied.
 * However, not all of the devices have been fully tested. Activating the timer-
 * shot may cause a WDT RESET during streaming.
 * 
 * camera model declaration moved later in code
 */
// const ESP32Cam::CameraId  model = ESP32Cam::CameraId::CAMERA_MODEL_AI_THINKER;
// const ESP32Cam::CameraId  model = ESP32Cam::CameraId::CAMERA_MODEL_ESP_EYE;
// const ESP32Cam::CameraId  model = ESP32Cam::CameraId::CAMERA_MODEL_M5STACK_ESP32CAM;
// const ESP32Cam::CameraId  model = ESP32Cam::CameraId::CAMERA_MODEL_M5STACK_NO_PSRAM;
// const ESP32Cam::CameraId  model = ESP32Cam::CameraId::CAMERA_MODEL_M5STACK_PSRAM;
// const ESP32Cam::CameraId  model = ESP32Cam::CameraId::CAMERA_MODEL_M5STACK_UNITCAM;
// const ESP32Cam::CameraId  model = ESP32Cam::CameraId::CAMERA_MODEL_M5STACK_V2_PSRAM;
// const ESP32Cam::CameraId  model = ESP32Cam::CameraId::CAMERA_MODEL_M5STACK_WIDE;
// const ESP32Cam::CameraId  model = ESP32Cam::CameraId::CAMERA_MODEL_TTGO_T_JOURNAL;
// const ESP32Cam::CameraId  model = ESP32Cam::CameraId::CAMERA_MODEL_WROVER_KIT;



// Version
const char *applicationName = "Servo & socket test";
const char *filename = "ESP2_CAM_WebSocket_Servo_Tests_4.ino";
const char *appVersion = "1.65";
const char *appTitle = "Servo v1.65";

#if defined(ARDUINO_ARCH_ESP8266)
  #include <ESP8266WiFi.h>
  #include <WiFiClient.h>
  #include <ESP8266WebServer.h>
  #include <ESP8266mDNS.h>
  const char *host = "esp8266";
  ESP8266WebServer server(80);
#elif defined(ARDUINO_ARCH_ESP32)
  #include <WiFi.h>
  #include <WebServer.h>
  #include <ESPmDNS.h>
  const char *host = "esp32";
  WebServer server(80);
  // NVS access : Preference library
  #include <Preferences.h>
  Preferences preferences;
  const char *pref_namespace = "AC_data";    // Preference namespace
  #define READ_WRITE false
  #define READ_ONLY true
#endif
#include <AutoConnect.h>
#include <WebSocketsServer.h>
#include "ESP32WebCam.h"
#include <stdio.h>
#include <stdarg.h>

#if defined(ESP_EYE) 
  #define LED_BUILTIN 21
  const ESP32Cam::CameraId  model = ESP32Cam::CameraId::CAMERA_MODEL_ESP_EYE;
#elif defined(ESP32_CAM)
  #define LED_BUILTIN 33
  const ESP32Cam::CameraId  model = ESP32Cam::CameraId::CAMERA_MODEL_AI_THINKER;
#elif defined(ESP32_DEVKIT)
  #define LED_BUILTIN 22  
#elif defined(ESP8266)
  //LED_BUILTIN already declared
#endif

// Servo 

static const int angle_max[] = {180,120,180,180,180,180,180,180,180,180,180,180,180,180,180,180};
static const int angle_min[] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
static const int angle_init[] = {90,45,140,90,90,90,90,90,90,90,90,90,90,90,90,90};
char debug_string[512];

/* replaced by onRoot
static const char HOME_PAGE[] PROGMEM = R"(
{
  "uri": "/",
  "title": "Home page",
  "menu": false,
  "element": [
    {
      "name": "text",
      "type": "ACText",
      "value": "Home page",
      "style": "font-family:Arial;font-size:18px;font-weight:400;color:#191970"
    },
    {
      "name": "text2",
      "type": "ACText",
      "value": "List files",
      "style": "font-family:Arial;font-size:18px;font-weight:400;color:#191970",
      "uri": "/list?dir=/"
    }    
  ]
}
)";
*/

static const char InputPage[] PROGMEM = R"(
{
  "name" : "inputForm",
  "uri" : "/input",
  "menu" : true,
  "element" : [
    {
      "name": "input",
      "type": "ACInput",
      "label": "Input"
    },
    {
      "name": "saveInput",
      "type": "ACSubmit",
      "value": "Save",
      "uri": "/"
    }
  ]
}
)";

static const char LED_ONOFF[] PROGMEM = R"(
{
  "uri": "/led",
  "title": "LED",
  "menu": true,
  "element": [
    {
      "name": "caption",
      "type": "ACText",
      "value": "BUILT-IN LED",
      "style": "font-weight:bold;font-size:25px;text-align:center;",
      "posterior": "div"
    },
    {
      "name": "onoff",
      "type": "ACButton",
      "value": "ON"
    }
  ]
}
)";

// Image sensor settings page
const char  CAMERA_SETUP_PAGE[] = R"*(
{
  "title": "Camera",
  "uri": "/_setting",
  "menu": true,
  "element": [
    {
      "name": "css",
      "type": "ACStyle",
      "value": ".noorder label{display:inline-block;min-width:150px;padding:5px;} .noorder select{width:160px} .magnify{width:20px}"
    },
    {
      "name": "res",
      "type": "ACSelect",
      "label": "Resolution",
      "option": [
        "UXGA(1600x1200)",
        "SXGA(1280x1024)",
        "XGA(1024x768)",
        "SVGA(800x600)",
        "VGA(640x480)",
        "CIF(400x296)",
        "QVGA(320x240)",
        "HQVGA(240x176)",
        "QQVGA(160x120)"
      ],
      "selected": 4
    },
    {
      "name": "qua",
      "type": "ACRange",
      "label": "Quality",
      "value": 10,
      "min": 10,
      "max": 63,
      "magnify": "infront"
    },
    {
      "name": "con",
      "type": "ACRange",
      "label": "Contrast",
      "value": 0,
      "min": -2,
      "max": 2,
      "magnify": "infront"
    },
    {
      "name": "bri",
      "type": "ACRange",
      "label": "Brightness",
      "value": 0,
      "min": -2,
      "max": 2,
      "magnify": "infront"
    },
    {
      "name": "sat",
      "type": "ACRange",
      "label": "Saturation",
      "value": 0,
      "min": -2,
      "max": 2,
      "magnify": "infront"
    },
    {
      "name": "se",
      "type": "ACSelect",
      "label": "Special Effect",
      "option": [
        "No Effect",
        "Negative",
        "Grayscale",
        "Red Tint",
        "Green Tint",
        "Blue Tint",
        "Sepia"
      ],
      "selected": 1
    },
    {
      "name": "awb",
      "type": "ACCheckbox",
      "label": "AWB",
      "labelposition": "infront",
      "checked": true
    },
    {
      "name": "wbg",
      "type": "ACCheckbox",
      "label": "AWB Gain",
      "labelposition": "infront",
      "checked": true
    },
    {
      "name": "wbm",
      "type": "ACSelect",
      "label": "WB Mode",
      "option": [
        "Auto",
        "Sunny",
        "Cloudy",
        "Office",
        "Home"
      ],
      "selected": 1
    },
    {
      "name": "aec",
      "type": "ACCheckbox",
      "label": "AEC SENSOR",
      "labelposition": "infront",
      "checked": true
    },
    {
      "name": "dsp",
      "type": "ACCheckbox",
      "label": "AEC DSP",
      "labelposition": "infront",
      "checked": true
    },
    {
      "name": "ael",
      "type": "ACRange",
      "label": "AE Level",
      "value": 0,
      "min": -2,
      "max": 2,
      "magnify": "infront"
    },
    {
      "name": "exp",
      "type": "ACRange",
      "label": "Exposure",
      "value": 204,
      "min": 0,
      "max": 1200,
      "magnify": "infront",
      "style": "margin-left:20px;width:110px"
    },
    {
      "name": "agc",
      "type": "ACCheckbox",
      "label": "AGC",
      "labelposition": "infront",
      "checked": true
    },
    {
      "name": "agv",
      "type": "ACRange",
      "label": "AGC Gain (Nx)",
      "value": 5,
      "min": 1,
      "max": 31,
      "magnify": "infront"
    },
    {
      "name": "acl",
      "type": "ACRange",
      "label": "Gain Ceiling (2^)",
      "value": 0,
      "min": 1,
      "max": 7,
      "magnify": "infront"
    },
    {
      "name": "bpc",
      "type": "ACCheckbox",
      "label": "DPC Black",
      "labelposition": "infront",
      "checked": true
    },
    {
      "name": "wpc",
      "type": "ACCheckbox",
      "label": "DPC White",
      "labelposition": "infront",
      "checked": true
    },
    {
      "name": "gma",
      "type": "ACCheckbox",
      "label": "GMA enable",
      "labelposition": "infront",
      "checked": true
    },
    {
      "name": "lec",
      "type": "ACCheckbox",
      "label": "Lense Correction",
      "labelposition": "infront",
      "checked": true
    },
    {
      "name": "hmi",
      "type": "ACCheckbox",
      "label": "H-Mirror",
      "labelposition": "infront"
    },
    {
      "name": "vfl",
      "type": "ACCheckbox",
      "label": "V-Flip",
      "labelposition": "infront"
    },
    {
      "name": "dcw",
      "type": "ACCheckbox",
      "label": "DCW (Downsize EN)",
      "labelposition": "infront"
    },
    {
      "name": "set",
      "type": "ACSubmit",
      "value": "SET",
      "uri": "/set"
    }
  ]
}
)*";

// Transition destination for CAMERA_SETUP_PAGE
// It will invoke the handler as setSensor function for setting the image sensor.
// The `response` is ana attribute added in AutoConnect v1.3.2 to suppress the
// HTTP response from AutoConnect. AutoConnectAux handlers with the
// `"response":false` can return their own HTTP response.
const char  CAMERA_SETUP_EXEC[] = R"*(
{
  "title": "Camera",
  "uri": "/set",
  "response": false,
  "menu": false
}
)*";

void debug_printf( const char * format, ... )
{
  #if defined(DEBUG)
    char buffer[256];
    va_list args;
    va_start (args, format);
    vsnprintf (buffer,256,format, args);
    Serial.print(buffer);
    va_end (args);
  #endif
}
void debug_printf( String s )
{
  #if defined(DEBUG)
    Serial.print(s);
  #endif
}
// format bytes to string
String formatBytes(size_t bytes) {
  if (bytes < 1024) {
    return String(bytes) + "B";
  } else if (bytes < (1024 * 1024)) {
    return String(bytes / 1024.0) + "KB";
  } else if (bytes < (1024 * 1024 * 1024)) {
    return String(bytes / 1024.0 / 1024.0) + "MB";
  } else {
    return String(bytes / 1024.0 / 1024.0 / 1024.0) + "GB";
  }
}

String getContentType(String filename) {
  if (server.hasArg("download")) {
    return "application/octet-stream";
  } else if (filename.endsWith(".htm")) {
    return "text/html";
  } else if (filename.endsWith(".html")) {
    return "text/html";
  } else if (filename.endsWith(".css")) {
    return "text/css";
  } else if (filename.endsWith(".js")) {
    return "application/javascript";
  } else if (filename.endsWith(".png")) {
    return "image/png";
  } else if (filename.endsWith(".gif")) {
    return "image/gif";
  } else if (filename.endsWith(".jpg")) {
    return "image/jpeg";
  } else if (filename.endsWith(".ico")) {
    return "image/x-icon";
  } else if (filename.endsWith(".xml")) {
    return "text/xml";
  } else if (filename.endsWith(".pdf")) {
    return "application/x-pdf";
  } else if (filename.endsWith(".zip")) {
    return "application/x-zip";
  } else if (filename.endsWith(".gz")) {
    return "application/x-gzip";
  }
  return "text/plain";
}

