gcadet2016/ESP32-CAM_Bras_robot/ESP32-CAM_Bras_robot.ino
bool handleFileRead(String path) {
  debug_printf("handleFileRead:");
  //debug_printf("handleFileRead: %s\n", path);
  debug_printf(path);
  debug_printf("\n");
  if (path.endsWith("/")) {
    path += "index.htm";
  }
  String contentType = getContentType(path);
  String pathWithGz = path + ".gz";
  if (SPIFFS.exists(pathWithGz) || SPIFFS.exists(path)) {
    if (SPIFFS.exists(pathWithGz)) {
      path += ".gz";
    }
    debug_printf("Opening file\n");
    File file = SPIFFS.open(path, "r");
    server.streamFile(file, contentType);
    file.close();
    debug_printf("File closed\n");
    return true;
  } else {
    Serial.printf("File not found:\n");
  }
  return false;
}

// Source: https://github.com/Hieromon/AutoConnect/blob/master/examples/WebCamServer/WebCamServer.ino
// ESP32WebCam instance; Hosts a different web server than the one hosted by AutoConect.
// If you want to assign a different port than the default, uncomment the
// following two lines and enable _cameraServerPort value. _cameraServerPort is
// the port on which the http server started by ESP32WebCam will listen.
const uint16_t _cameraServerPort = 82; // Default is 3000.
ESP32WebCam webcam(_cameraServerPort);
//ESP32WebCam webcam;

// ===================== AutoConnect global var ==================================================
AutoConnect portal(server);
AutoConnectConfig config;
AutoConnectAux auxInput;
AutoConnectAux auxMqttSettings;
AutoConnectAux auxHelloWorld;
AutoConnectAux auxMqttSave;


// ===================== Event handler ===========================================================
void handleFileList() {
  if (!server.hasArg("dir")) {
    server.send(500, "text/plain", "BAD ARGS");
    return;
  }
  
  String path = server.arg("dir");
  debug_printf("handleFileList: %s\n", path);
  #ifdef ARDUINO_ARCH_ESP8266
    Dir dir = SPIFFS.openDir(path);
  #elif defined(ARDUINO_ARCH_ESP32)
    File root = SPIFFS.open(path);
  #endif
  path = String();

  String output = "[";
  #ifdef ARDUINO_ARCH_ESP8266
    while (dir.next()) {
      File entry = dir.openFile("r");
      if (output != "[") {
        output += ',';
      }
      bool isDir = false;
      output += "{\"type\":\"";
      output += (isDir) ? "dir" : "file";
      output += "\",\"name\":\"";
      output += String(entry.name()).substring(1);
      output += "\",\"size\":\"";
      output += String(entry.size());
      output += "\"}";
      entry.close();
    }
  #elif defined(ARDUINO_ARCH_ESP32)
    if(root.isDirectory()){
      File file = root.openNextFile();
      while(file){
        if (output != "[") {
          output += ',';
        }
        output += "{\"type\":\"";
        output += (file.isDirectory()) ? "dir" : "file";
        output += "\",\"name\":\"";
        output += String(file.name()).substring(0);
        output += "\",\"size\":\"";
        output += String(file.size());
        output += "\"}";
        file = root.openNextFile();
      }
    }
  #endif
  
  output += "]";
  server.send(200, "text/json", output);
}

// Event handler that attaches to an AutoConnectButton named `led`.
// This event handler receives a reference to AutoConnectButton as `led`
// and a reference to the AutoConnectAux of the page rendered in the client
// browser.
void ledOnOff(AutoConnectButton& me, AutoConnectAux& ledOnOff) {
  debug_printf("ledOnOff execution: %s",  me.value);
  if (me.value == "ON") {
    // Since "ON" has been passed from the AutoConnectButton as `led`. Let the
    // LED turns on.
    #if defined(ESP_EYE) || defined(ESP32_DEVKIT) || defined(ESP8266)
      digitalWrite(LED_BUILTIN, HIGH);
    #elif defined(ESP32_CAM)
      digitalWrite(LED_BUILTIN, LOW);
    #endif
    // Direct assignment to AutoConnectElement values is not reflected on the
    // web page; use the `response` function to update the value of the element
    // on the web page.
    me.response("OFF");
    // The `on` event handler attached to AutoConnectElements can override the
    // value and attributes of other elements placed on that AutoConnectAux page.
    // For example, a following statement changes the font color of the `caption`
    // element along with a LED blinking.
    ledOnOff["caption"].response("style", "{\"color\":\"red\"}");
  }
  if (me.value == "OFF") {
    // Since a value "OFF" has been passed from the AutoConnectButton as `led`.
    // Let the LED turns off.
    #if defined(ESP_EYE) || defined(ESP32_DEVKIT) || defined(ESP8266)
      digitalWrite(LED_BUILTIN, LOW);
    #elif defined(ESP32_CAM)
      digitalWrite(LED_BUILTIN, HIGH);
    #endif
    me.response("ON");
    ledOnOff["caption"].response("style", "{\"color\":\"black\"}");
  }
}

// An on-page handler for '/' access
// Use this page for documentation
void onRoot() {
  String  content =
  "<html>"
  "<head><meta name='viewport' content='width=device-width, initial-scale=1'></head>"
  "<body>"
  "<div>INPUT: {{value}}</div>"
  "<p><a href=""http://{{localhost}}/_ac>AutoConnect Page</a></p>"
  "<p><a href=""http://{{localhost}}/input>Input test Page</a></p>"
  "<p><a href=""http://{{localhost}}/list?dir=/>File list</a></p>"
  "<p><a href=""http://{{localhost}}/ws_basic>Test servos</a></p>"
  "<p><a href=""http://{{localhost}}/ws_servo1>Test servos avec camera</a></p>"
  "<p><a href=""http://{{localhost}}/ws_servo2>Test servo 2</a></p>"
  "<p><a href=""http://{{localhost}}/cam>Camera</a></p>"
  "</body>"
  "</html>";

  auxInput.fetchElement();    // Preliminary acquisition

  // For this steps to work, need to call fetchElement function beforehand.
  String value = auxInput["input"].value;
  content.replace("{{localhost}}", host);
  content.replace("{{value}}", value);
  server.send(200, "text/html", content);
}

// ===================== Cam procedures =============================================================
// Endpoint that leads request to the root page to webcamview.html
const char*  const _viewerUrl = "/webcam"; 
// Viewer-UI content
const char*  const _webcamserver_html = "/webcamview.html";

// AutoConnectAUx entry point
const char*  const _sensorUrl = "/_setting";
const char*  const _setUrl = "/set";

