gcadet2016/ESP32-CAM_Bras_robot/ESP32-CAM_Bras_robot.ino
// Choose the file system properly to fit the SD card interface of the ESP32
// module you are using.
// In typical cases, SD is used for the VSPI interface, and MMC is used for the
// HS2 interface.
const char*  const _fs = "sd";
//const char*  const _fs = "mmc";

// Specifying the time zone and assigning NTP.
// Required to add the correct local time to the export file name of the
// captured image. This assignment needs to be localized.
// This sketch works even if you omit the NTP server specification. In that
// case, the suffix timestamp of the captured image file is the elapsed time
// since the ESP module was powered on.
const char*  const _tz = "UTC+1";
const char*  const _ntp1 = "europe.pool.ntp.org";
const char*  const _ntp2 = "pool.ntp.org";

// AutoConnectAux handler for CAMERA_SETUP_EXEC
// Read the camera status via the ESP32 Camera Driver and update it with the
// sensor parametes defined in each AutoConnect element in CAMERA_SETUP?PAGE.
String setSensor(AutoConnectAux& aux, PageArgument& args) {
  AutoConnectAux& cameraSetup = *portal.aux(_sensorUrl);    // /_setting
  camera_status_t status;

  // Take over the current settings
  webcam.sensor().getStatus(&status);

  // Framesize
  const String& resolution = cameraSetup["res"].as<AutoConnectSelect>().value();
  debug_printf(resolution);
  if (resolution == "UXGA(1600x1200)")
    status.framesize = FRAMESIZE_UXGA;
  else if (resolution == "SXGA(1280x1024)")
    status.framesize = FRAMESIZE_SXGA;
  else if (resolution == "XGA(1024x768)")
    status.framesize = FRAMESIZE_XGA;
  else if (resolution == "SVGA(800x600)")
    status.framesize = FRAMESIZE_SVGA;
  else if (resolution == "VGA(640x480)")
    status.framesize = FRAMESIZE_VGA;
  else if (resolution == "CIF(400x296)")
    status.framesize = FRAMESIZE_CIF;
  else if (resolution == "QVGA(320x240)")
    status.framesize = FRAMESIZE_QVGA;
  else if (resolution == "HQVGA(240x176)")
    status.framesize = FRAMESIZE_HQVGA;
  else if (resolution == "QQVGA(160x120)")
    status.framesize = FRAMESIZE_QQVGA;

  // Pixel granularity
  status.quality = cameraSetup["qua"].as<AutoConnectRange>().value;

  // Color solid adjustment
  status.contrast = cameraSetup["con"].as<AutoConnectRange>().value;
  status.brightness = cameraSetup["bri"].as<AutoConnectRange>().value;
  status.saturation = cameraSetup["sat"].as<AutoConnectRange>().value;

  // SE
  const String& se = cameraSetup["se"].as<AutoConnectSelect>().value();
  debug_printf(se);
  if (se == "No Effect")
    status.special_effect = 0;
  if (se == "Negative")
    status.special_effect = 1;
  if (se == "Grayscale")
    status.special_effect = 2;
  if (se == "Red Tint")
    status.special_effect = 3;
  if (se == "Green Tint")
    status.special_effect = 4;
  if (se == "Blue Tint")
    status.special_effect = 5;
  if (se == "Sepia")
    status.special_effect = 6;

  // White Balance effection
  status.awb = cameraSetup["awb"].as<AutoConnectCheckbox>().checked ? 1 : 0;
  status.awb_gain = cameraSetup["wbg"].as<AutoConnectCheckbox>().checked ? 1 : 0;
  const String& wbMode = cameraSetup["wbm"].as<AutoConnectSelect>().value();
  debug_printf(wbMode);
  if (wbMode == "Auto")
    status.wb_mode = 0;
  else if (wbMode == "Sunny")
    status.wb_mode = 1;
  else if (wbMode == "Cloudy")
    status.wb_mode = 2;
  else if (wbMode == "Office")
    status.wb_mode = 3;
  else if (wbMode == "Home")
    status.wb_mode = 4;

  // Automatic Exposure Control, Turn off AEC to set the exposure level.
  status.aec = cameraSetup["aec"].as<AutoConnectCheckbox>().checked ? 1 : 0;
  status.aec2 = cameraSetup["dsp"].as<AutoConnectCheckbox>().checked ? 1 : 0;
  status.ae_level = cameraSetup["ael"].as<AutoConnectRange>().value;
  status.aec_value = cameraSetup["exp"].as<AutoConnectRange>().value;

  // Automatic Gain Control
  status.agc = cameraSetup["agc"].as<AutoConnectCheckbox>().checked ? 1 : 0;
  status.agc_gain = cameraSetup["agv"].as<AutoConnectRange>().value - 1;
  status.gainceiling = cameraSetup["acl"].as<AutoConnectRange>().value - 1;

  // Gamma (GMA) function is to compensate for the non-linear characteristics of
  // the sensor. Raw gamma compensates the image in the RAW domain.
  status.raw_gma = cameraSetup["gma"].as<AutoConnectCheckbox>().checked ? 1 : 0;
  
  // Defect pixel cancellation, Black pixel and White pixel
  status.bpc = cameraSetup["bpc"].as<AutoConnectCheckbox>().checked ? 1 : 0;
  status.wpc = cameraSetup["wpc"].as<AutoConnectCheckbox>().checked ? 1 : 0;

  // Lense correction, According to the area where each pixel is located,
  // the module calculates a gain for the pixel, correcting each pixel with its
  // gain calculated to compensate for the light distribution due to lens curvature.
  status.lenc = cameraSetup["lec"].as<AutoConnectCheckbox>().checked ? 1 : 0;

  // Mirror and Flip
  status.hmirror = cameraSetup["hmi"].as<AutoConnectCheckbox>().checked ? 1 : 0;
  status.vflip = cameraSetup["vfl"].as<AutoConnectCheckbox>().checked ? 1 : 0;

  // Reducing image frame UXGA to XGA
  status.dcw = cameraSetup["dcw"].as<AutoConnectCheckbox>().checked ? 1 : 0;

  // Reflecting the setting values on the sensor
  if (!webcam.sensor().setStatus(status))
    Serial.println("Failed to set camera sensor");

  // Sends a redirect to forward to the root page displaying the streaming from
  // the camera.
  aux.redirect(viewerUrl().c_str());

  return String();
}

// Assemble the query string for webcamview.html according the configuration
// by the sketch.
// The webcamview.html accepts the following query parameters:
// - host=HOSTNAME                            (default: 0.0.0.0)
// - port=PORT_NUMBER                         (default: 3000)
// - stream=STREAMING_PATH                    (default: _stream)
// - capture=CAPTURING_PATH                   (default: _capture)
// - prompt=PROMPTING_PATH_FOR_REMOTE_CONTROL (default: _prompt)
// - setting=AUTOCONNECTAUX_SETTING_PATH      (default: undefined)
// - fs={sd|mmc}                              (default: mmc)
// - ac=AUTOCONNECT_ROOT_PATH                 (default: _ac) 
// - title=VIEWER_PAGE_HEADER_TITLE           (default: undefined)
String viewerUrl(void) {
  String  url = String(_viewerUrl)
              + "?host=" + WiFi.localIP().toString()
              + "&port=" + String(webcam.getServerPort())
              + "&capture=" + String(webcam.getCapturePath())
              + "&prompt=" + String(webcam.getPromptPath())
              + "&stream=" + String(webcam.getStreamPath())
              + "&fs=" + String(_fs)
              + "&ac=" AUTOCONNECT_URI
              + "&setting=" + String(_sensorUrl)
              + "&title=" + String(WiFi.getHostname());
  return url;
}

// Directs the request to the root to webcamview.html.
// This function exists only to assemble the query string.
void handleCamPage(void) {
  server.sendHeader("Location", viewerUrl());
  server.send(302, "text/plain", "");
  server.client().stop();
}

// Read webcamview.html from SPIFFS and send it to the client as response.
// The query string given by handleRootPage is taken over tby the 302-redirect.
void handleViewPage(void) {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("WiFi is disconnected.");
    Serial.println("Viewer will not be available until connection is restored.");
    server.send(500, "text/plain", "WiFi is not connected. Viewer will not be available until connection is restored.");
    return;
  }

  File viewPage = SPIFFS.open(_webcamserver_html, FILE_READ);
  if (viewPage) {
    server.streamFile(viewPage, "text/html");
    close(viewPage);
  }
  else {
    Serial.printf("Viewer %s could not load, check your data folder and upload it.\n", _webcamserver_html);
    server.send(500, "text/plain", String(_webcamserver_html) + " open failed");
  }
}

// ===================== MQTT procedures =============================================================
// The handler called before HTML generating
String initMqttSettingsForm(AutoConnectAux& aux, PageArgument& args) {
  debug_printf("Init mqtt settings\n");
  AutoConnectInput& mqttserver = aux.getElement<AutoConnectInput>("mqttserver");
  // Set initial value for the input box in the form.
  //mqttserver.value = "Initial value";  
  mqttserver.value = getMqttSettings();

