gcadet2016/ESP32-CAM_Bras_robot/ESP32-CAM_Bras_robot.ino
  //AutoConnectText& caption = aux.getElement<AutoConnectText>("caption");
  //caption.value = "Input mqtt broker settings";
  return String();
}

// HTTP Post event handler for mqttSettings page
// https://hieromon.github.io/AutoConnect/acupload.html#basic-steps-of-the-file-upload-sketch
String postMqttSettings(AutoConnectAux& aux, PageArgument& args) {
  // When mqtt_Settings Save button is clicked --> invoke HTTP POST to /mqtt_save page
  // aux: target page = /mqtt_save
  // args: HTTP post arguments from source page = /mqtt_settings
  AutoConnectText& saveStatusMsg = aux.getElement<AutoConnectText>("caption2");
  saveStatusMsg.value = "MQTT settings saved";
  
  saveMqttSettings(args.arg("mqttserver"));
  return String();
}
/*
void onMqttSave(AutoConnectAux& aux, PageArgument& args) {
  auxMqttSettings.fetchElement();    // Preliminary acquisition

  // For this steps to work, need to call fetchElement function beforehand.
  String value = auxMqttSettings["mqttserver"].value;
  Serial.println("MQTT server:" + value);

}
*/

// ===================== Preferences =============================================================

size_t saveMqttSettings(String brocker){
  Serial.printf("Saving setting to SPIFFS: %s\n", brocker);
  preferences.begin(pref_namespace, READ_WRITE);
  size_t r = preferences.putString("mqttBroker", brocker);
  preferences.end();
  return r;
}

String getMqttSettings(){
  preferences.begin(pref_namespace, READ_ONLY);
  String r = preferences.getString("mqttBroker", "");
  preferences.end();
  return r;
}


/* ===================== LU9685 & webSocket ============================================
addr: the hardware address of the module
num: channels 0-15
OFF is 0-180, and no signal is output when OFF is greater than or equal to 200, and the servo is released at this time
*/

// Select LU9685 address
#if defined(ESP32_CAM)
  // ESP32-CAM connected to LU9685 via Serial port
  #define LU9685_adrr1 0x08   // Solder bridge on A2. Caution UART address != I2C Address.
#elif defined(ESP32_DEVKIT)
  // ESP32 Devkitc V4 connected to LU9685 via I2C
  #define LU9685_adrr1 0x04 // Solder bridge on A2. Caution UART address != I2C Address. 
#elif defined(ESP_EYE)
  // no LU9685 connected
#elif defined(ESP8266)
  // to be completed
#endif

#define AC_DEBUG
WebSocketsServer webSocket = WebSocketsServer(81);

void reset_LU9685() {
  Serial.println("Reseting LU9685:\n");
  #ifdef ESP32_DEVKIT
    Wire.beginTransmission(LU9685_adrr1);
    Wire.write(0xFB);
    Wire.write(0xFB);
    Wire.endTransmission();
  #elif defined(ESP32_CAM)
    Serial.write(0xFA);
    Serial.write(LU9685_adrr1);
    Serial.write(0xFB);
    Serial.write(0xFB);
    Serial.write(0xFE);
  #elif defined(ESP_EYE)
    // do nothing
  #elif defined(ESP8266)
    // to be completed
  #endif
  debug_printf("\n");
}

void setPWM(int servo, int angle){
  if(angle < angle_min[servo]) angle = angle_min[servo];
  if(angle > angle_max[servo]) angle = angle_max[servo];
  debug_printf("Set servo %i to %i\n", servo, angle);

  #ifdef ESP32_DEVKIT
    byte error;
    Wire.beginTransmission(LU9685_adrr1);
    Wire.write(servo);
    Wire.write(angle);
    error = Wire.endTransmission();
    if (error != 0) {
      Serial.printf("I2C error:%s\n", error)
    }
  #elif defined(ESP32_CAM)
    Serial.write(0xFA);
    Serial.write(LU9685_adrr1);
    Serial.write(servo);
    Serial.write(angle);
    Serial.write(0xFE);
    debug_printf("\n");
  #elif defined(ESP_EYE)
    Serial.println("No servo on ESP_EYE");
  #elif defined(ESP8266)
    Serial.println("Not implemented on ESP8266");  
  #endif
}

void webSocketEvent(uint8_t num, WStype_t type, uint8_t * payload, size_t length){
  /*
  switch (type) {
    case WStype_DISCONNECTED:
      Serial.printf("[%u] Disconnected!\n", num);
      break;
    case WStype_CONNECTED:
      {
        IPAddress ip = webSocket.remoteIP(num);
        Serial.printf("[%u] Connected from %d.%d.%d.%d\n", num, ip[0], ip[1], ip[2], ip[3]);
      }
      break;
    case WStype_TEXT:
      Serial.printf("[%u] Received text: %s\n", num, payload);
      // Send a response back to the client
      webSocket.sendTXT(num, "Received:  " + String((char*)payload));
      break;
  }
  */
  if(type == WStype_TEXT){
    if(payload[0] == 'S'){ // S0=90
      uint16_t servoNum = (uint16_t) strtol((const char *) &payload[1], NULL, 16);
      uint16_t servoVal = (uint16_t) strtol((const char *) &payload[3], NULL, 10);

      debug_printf("cmd: S%i=%i\n", servoNum, servoVal);

      setPWM(servoNum, servoVal);
      webSocket.sendTXT(num, "\nReceived:  " + String((char*)payload));
    }

    else{
      char buffer[length];
      for(int i = 0; i < length; i++)
        buffer[i] = payload[i];
      debug_printf("%s\n",buffer);
    }
  }
}

void initServos(){
  for(int i = 0; i < 16; i++){
    setPWM(i, angle_init[i]);
  }
}

void time_sync_notification(struct timeval *tv)
{
  debug_printf("Notification of a time synchronization event");
}
// ===================== Setup ===========================================================


void setup() {
  Serial.begin(BAUD_RATE);
  delay(1000);
  Serial.print("\n");
  Serial.printf("\n%s  v%s (%s)\n", applicationName, appVersion, filename);
  
  // Led initialization -led off)
  pinMode(LED_BUILTIN, OUTPUT);
  #if defined(ESP_EYE) || defined(ESP32_DEVKIT) || defined(ESP8266)
    digitalWrite(LED_BUILTIN, LOW);
  #elif defined(ESP32_CAM)
    digitalWrite(LED_BUILTIN, HIGH);
  #endif

  #ifdef ARDUINO_ARCH_ESP8266
    debug_printf("Configured for ESP8266 architecture\n");
  #elif defined(ARDUINO_ARCH_ESP32)
    debug_printf("Configured for ESP32 architecture\n");
  #endif

  #ifdef ESP32_CAM
    debug_printf("Configured for ESP32-CAM\n");
  #elif defined(ESP32_DEVKIT)
    debug_printf("Configured for ESP32 devkit C V4\n");
    Wire.begin();        // i2c bus (address optional for master)
  #elif defined(ESP_EYE)
    debug_printf("Configured for ESP-EYE\n");
  #elif defined(ESP8266)
    debug_printf("Configured for ESP8266\n");    
  #endif

  reset_LU9685();


  // Initialize the image sensor during the start phase of the sketch.
  esp_err_t err = webcam.sensorInit(model);
  if (err != ESP_OK)
    Serial.printf("Camera init failed 0x%04x\n", err);

  // Loading the image sensor configurarion UI provided by AutoConnectAux.
  portal.load(FPSTR(CAMERA_SETUP_PAGE));
  if (portal.load(FPSTR(CAMERA_SETUP_EXEC)))
    portal.on(_setUrl, setSensor);

  // AutoConnect configuration
  config.title = appTitle; 
  
