gcadet2016/ESP32-CAM_Bras_robot/ESP32-CAM_Bras_robot.ino
  /*
  config.auth = AC_AUTH_DIGEST;
  config.authScope = AC_AUTHSCOPE_AUX;
  config.username = "user";
  config.password = "password";
  */
  portal.config(config);
  portal.home("/");  // default value = /

 
  // Load AutoConnect custom web page from SPIFFS
  // AutoConnect custom web pages with json
  // https://hieromon.github.io/AutoConnect/acjson.html
  debug_printf("Loading custom AC pages...");

  //AutoConnectAux page;
  auxInput.load(InputPage);
  //portal.join(auxInput);

  SPIFFS.begin();
  {
    //portal.load(FPSTR(HOME_PAGE));  replaced by OnRoot
    portal.load(FPSTR(LED_ONOFF));

    File json_file = SPIFFS.open("/hello_world.json", "r");
    if(!auxHelloWorld.load(json_file)){
      Serial.println("ERROR: hello_world page load failed");
    };
    //portal.load(json_file); //Autre solution
    json_file.close();

    json_file = SPIFFS.open("/mqtt_settings.json", "r");
    if(!auxMqttSettings.load(json_file)){
      Serial.println("ERROR: mqtt_settings page load failed");
    };
    //portal.load(json_file); //Autre solution
    json_file.close();

    json_file = SPIFFS.open("/mqtt_save.json", "r");
    if(!auxMqttSave.load(json_file)){
      Serial.println("ERROR: mqtt_save page load failed");
    };
    //portal.load(json_file); //Autre solution
    json_file.close();
  }
  SPIFFS.end();

  portal.join({auxInput, auxHelloWorld, auxMqttSettings, auxMqttSave});

  // give your custom web page the ability to handle events using Fetch API
  // https://hieromon.github.io/AutoConnect/acinteract.html#allow-autoconnectelements-to-have-event-processing
  // Note: La déclaration de la page /led n'a pas utilisé AutoConnectAux, donc on récupère la réfrérence maintenant
  AutoConnectAux& led = portal.locate("/led");  // Récupère une référence vers l'AutoConnectAux de la page /led
  AutoConnectButton& onOff = led["onoff"].as<AutoConnectButton>();  // onOff est la référence vers AutoConnectButton qui hérite de AutoConnectElement 
  onOff.on(ledOnOff); // Register the event handler with the AutoConnectElement::on function

  // mqttSettings form:
  auxMqttSettings.on(initMqttSettingsForm, AC_EXIT_AHEAD);
  //auxMqttSettings.on(appendMqttSettingsForm, AC_EXIT_LATER);      // Caution: this new handler override the previous one

  // mqttSettings form HTTP POST --> Invoke /mqtt_save page 
  // mqtt_save page handler configured with AutoConnectAux object
  auxMqttSave.on(postMqttSettings); // HTTP Post event handler configuration

  //Web page out of AutoConnect : root page
  server.on("/", onRoot);  // Register the on-page handler

  //Web page out of AutoConnect : list directory
  server.on("/list", HTTP_GET, handleFileList);

  server.on("/ws_basic", HTTP_GET, []() {
    if (!handleFileRead("/ws_basic.html")) {
      server.send(404, "text/plain", "FileNotFound");
    }
  });
  server.on("/ws_servo2", HTTP_GET, []() {
    if (!handleFileRead("/ws_servo2.html")) {
      server.send(404, "text/plain", "FileNotFound");
    }
  });
  server.on("/ws_servo1", HTTP_GET, []() {
    if (!handleFileRead("/ws_servo1.html")) {
      server.send(404, "text/plain", "FileNotFound");
    }
  });
  // InputPage HTTP POST handler
  // Page handler configured with AutoConnectAux object
  //auxInput.on(postInputPage);
  
  // Page handler configured with AutoConnect object (portal)
  // portal.on("/input", postInputPage);


  // Undocumented feature
  //AutoConnectAux FSBedit("/edit", "Edit");
  //AutoConnectAux FSBlist("/list?dir=\"/\"", "List");
  //portal.join({ FSBedit, FSBlist });



  Serial.println("portal about to begin: join the Wifi esp32ap AP with your phone");
  Serial.println("Then a window is opened on the phone to configure the Wifi SSID and password.");
  Serial.println("If this operation has been done, the following logs will ask to browse the url.");
  if (portal.begin()) {
    Serial.println("Web server started:" + WiFi.localIP().toString());
    //Serial.println("  Browse url: http://" + WiFi.localIP().toString() + "/");
    //Serial.println("  Browse url: http://" + WiFi.localIP().toString() + "/list?dir=/");
    Serial.println("Disconnect command will reset the full configuration");

    // Allow hostname.local reach in the local segment by mDNS.
    // MDNS.begin(WiFi.getHostname());
    // exemple de Wifi.getHostname() : esp32-773E11.local

    if (MDNS.begin(host)) {
      MDNS.addService("http", "tcp", 80);
      Serial.printf("Open http://%s.local \n", host);
      Serial.printf("Autoconnect menu: http://%s.local/_ac \n", host);
    }
    else {
      Serial.println("mDNS start failed");
    }

    // By configuring NTP, the timestamp appended to the capture filename will
    // be accurate. But this procedure is optional. It does not affect ESP32Cam
    // execution.
    //configTzTime(_tz, _ntp1 ,_ntp2);
    configTzTime("CET-1CEST,M3.5.0/03,M10.5.0/03", _ntp1);
    // Activate ESP32WebCam while WiFi is connected.

    //sntp_set_time_sync_notification_cb(time_sync_notification);
    //configTzTime("CET-1CEST-2,M3.5.0/02:00:00,M10.5.0/03:00:00", _ntp1);

    #if defined(DEBUG)
      #define MAX_SIZE 64
      time_t timestamp = time( NULL );
      char buffer[MAX_SIZE];
      struct tm *pTime = localtime(&timestamp );
      strftime(buffer, MAX_SIZE, "%d/%m/%Y %H:%M:%S", pTime);
      Serial.println(buffer);
    #endif

    err = webcam.startCameraServer();

    if (err == ESP_OK) {
      // This sketch has two endpoints. One assigns the root page as the
      // entrance, and the other assigns a redirector to lead to the viewer-UI
      // which we have placed in SPIFFS with the name webcamview.html.
      server.on("/cam", handleCamPage);
      server.on(_viewerUrl, handleViewPage);
      Serial.printf("Camera streaming server  %s ready, port %u\n", WiFi.localIP().toString().c_str(), webcam.getServerPort());
      Serial.printf("Endpoint Capture:%s, Prompt:%s, Stream:%s\n", webcam.getCapturePath(), webcam.getPromptPath(), webcam.getStreamPath());
    }
    else
      Serial.printf("Camera server start failed 0x%04x\n", err);
  } else {
    Serial.println("portal.begin failure!");
  }



  // List all files stored in SPIFFS in Serial (not in web server)
  SPIFFS.begin();
  {
    #if defined(ARDUINO_ARCH_ESP8266)
      Dir dir = SPIFFS.openDir("/");
      while (dir.next()) {
        String fileName = dir.fileName();
        size_t fileSize = dir.fileSize();
        Serial.printf("FS File: %s, size: %s\n", fileName.c_str(), formatBytes(fileSize).c_str());
      }
    #elif defined(ARDUINO_ARCH_ESP32)
      File root = SPIFFS.open("/");
      File file = root.openNextFile();
      while (file) {
        String fileName = file.name();
        size_t fileSize = file.size();
        Serial.printf("FS File: %s, size: %s\n", fileName.c_str(), formatBytes(fileSize).c_str());
        file = root.openNextFile();
      }
    #endif
    Serial.printf("\n");
  }

  // Servo control
  webSocket.begin();
  webSocket.onEvent(webSocketEvent);

  initServos();

}

void loop() {
  portal.handleClient();

  #ifdef ARDUINO_ARCH_ESP8266
    MDNS.update();
  #endif
  webSocket.loop();
  // Attention Serial est utilisé par LU9685 sur ESP32-CAM
  if(Serial.available() > 0){     // forward incoming Serial command to webSocket
    char c[] = {(char)Serial.read()};
    webSocket.broadcastTXT(c, sizeof(c));
  }

  // Allow CPU to switch to other tasks.
  delay(1);
}